/**
 * Created by Alexander on 8/12/2016.
 */
package progKievUa.javaOOP.home.lesson7.generics.namesComparing;

/*
Names Comparing (*). Задан List<Sting> names. Выполнить задачи (каждая задача - отдельный метод, работающий
с исходным списком):
1. Отсортировать имена в алфавитном порядке.
2. Отсортировать имена в алфавитном порядке по убыванию.
3. Найти наименьшее имя в алфавитном порядке (использовать метод Collections.min(...)).
4. Отсортировать имена по количеству букв.
5. Отсортировать имена по количеству букв, а в группах, где количество букв одинаковое,
- в алфавитном порядке по убыванию.*/
