package java.progKievUa.javaOOP.home.lesson2.book;

/**
 * Created by Alexander on 7/20/2016.
 */
/*
Блинов. Глава 3. Вариант А. 5 (**). Book: id, Название, Автор (ы), Издательство, Год издания,
        Количество стра-ниц, Цена, Тип переплета.
        Создать массив объектов. Вывести:
        a)  список книг заданного автора;
        b)  список книг, выпущенных заданным издательством;
        c)  список книг, выпущенных после заданного года.
        Подсказки:
1. Конструктор по-умолчанию.
2. Приватные поля.
3. Геттеры/сеттеры для всех полей.
4. Код клиента в отдельном классе (BookRunner).
5. Можно пользоваться динамическими массивами. List<Book> books = new ArrayList<>();
*/